{
  "Why is the sky blue?": "Sunlight scatters off air molecules (Rayleigh scattering), favoring blue light.",
  "How do airplanes stay in the air?": "Wings create lift via pressure difference (Bernoulli’s principle).",
  "Why does time slow near a black hole?": "Extreme gravity warps spacetime (General Relativity).",
  "Can you create energy from nothing?": "No (Energy Conservation), but quantum fluctuations allow temporary particles.",
  "Why do mirrors flip left-right but not up-down?": "Mirrors reverse front-to-back; your brain interprets it as left-right.",
  "How does GPS account for relativity?": "Adjusts for time dilation (speed) and gravitational time warping.",
  "Why do bubbles pop?": "Soap film evaporates or stretches, breaking surface tension.",
  "What happens if you fall into a black hole?": "Spaghettification (tidal forces stretch you into noodles).",
  "Why is light both a particle and a wave?": "Quantum physics: behaves as waves or particles based on observation.",
  "Why does ice float?": "Water expands when freezing, making ice less dense.",
  "How do magnets work?": "Moving electrons create fields; aligned spins produce net magnetism.",
  "Why can’t we see air?": "Molecules are too small/spaced to scatter visible light.",
  "What is the speed of darkness?": "Darkness is light’s absence—it has no speed.",
  "Why do stars twinkle?": "Atmospheric turbulence bends starlight randomly.",
  "Can you break the speed of light?": "No—massive objects need infinite energy to reach it.",
  "What is the ultimate speed limit in the universe?": "The speed of light ($c$), approximately $3 \times 10^8 \text{ m/s}$.",
  "What is the smallest unit of light?": "A photon (the elementary particle of light).",
  "Why does a spinning top stay upright?": "Angular momentum (gyroscope effect) resists changes to its axis of rotation.",
  "How does sound travel through space?": "It doesn't—space is a vacuum, and sound needs a medium (like air or water) to travel.",
  "What is the difference between mass and weight?": "Mass is the amount of matter; weight is the force of gravity on that matter.",
  "Why does a dropped feather fall slower than a rock?": "Air resistance opposes the feather's motion more effectively due to its shape and density.",
  "What is kinetic energy?": "The energy an object possesses due to its motion.",
  "How does a simple machine like a lever work?": "It multiplies force over a longer distance, making work easier (conservation of energy).",
  "Why does a spoon look bent in a glass of water?": "Light refracts (bends) as it passes from water to air.",
  "What is nuclear fusion?": "Combining two light atomic nuclei to form a heavier one, releasing immense energy (like in the Sun).",
  "How does a microwave oven heat food?": "It uses electromagnetic waves that excite water molecules in food, causing them to vibrate and heat up.",
  "What is Planck's constant?": "The relationship between the energy of a photon and its frequency (fundamental to quantum mechanics).",
  "Why do hot air balloons float?": "Hot air is less dense than the cooler surrounding air, creating a buoyant force.",
  "What is the law of inertia?": "An object at rest stays at rest, and an object in motion stays in motion unless acted upon by an outside force (Newton's First Law).",
  "How does a battery create electricity?": "Through chemical reactions that move electrons from one terminal to another, creating potential difference.",
  "What is the Doppler effect?": "The change in frequency or wavelength of a wave in relation to an observer who is moving relative to the wave source.",
  "Why is the sound of thunder delayed after lightning?": "Light travels much faster than sound.",
  "What is a superconducting material?": "A material that can conduct electricity with zero resistance below a critical temperature.",
  "How does gravity work, according to Einstein?": "It is the curvature (warping) of spacetime caused by mass and energy.",
  "What is quantum entanglement?": "Two particles linked so their properties are correlated instantly, regardless of distance.",
  "Why does rubbing a balloon on hair create static electricity?": "Friction transfers electrons, giving the balloon a negative charge and the hair a positive charge.",
  "What is the photoelectric effect?": "Emission of electrons when light hits a material (proof that light is quantized into photons).",
  "How do noise-canceling headphones work?": "They produce an inverted sound wave to destructively interfere with and cancel outside noise.",
  "What is terminal velocity?": "The maximum speed an object reaches when falling through the air, where drag equals the force of gravity.",
  "Why does a guitar string produce sound?": "The vibrating string causes surrounding air molecules to vibrate, creating sound waves.",
  "What is a force field in physics?": "A region where an object experiences a non-contact force (e.g., gravity, electric, magnetic).",
  "How does a fiber optic cable transmit information?": "By transmitting light signals (photons) that bounce off the core's walls (total internal reflection).",
  "What is absolute zero?": "The lowest possible temperature -273.15 C where all particle motion stops.",
  "Why does a tea kettle whistle?": "Water vapor rushes through a small, restrictive opening, causing the air to vibrate rapidly.",
  "What is fusion in the core of the Sun?": "Hydrogen nuclei combine to form helium, releasing energy.",
  "How do physicists define 'work'?": "The energy transferred by a force acting on an object to move it a distance.",
  "What is resistance in electricity?": "The opposition to the flow of electric current in a circuit.",
  "Why is metal a good conductor of heat?": "It has free-moving electrons that can easily transfer thermal energy.",
  "What is Heisenberg's Uncertainty Principle?": "You cannot know both the exact position and the exact momentum of a particle simultaneously.",
  "How does a transformer change voltage?": "It uses two coils of wire to induce current, stepping voltage up or down based on the ratio of turns.",
  "What is the Casimir effect?": "A small attractive force between two uncharged, conductive plates in a vacuum due to quantum zero-point energy.",
  "Why is the visible spectrum only a small part of the light spectrum?": "Our eyes evolved to see the wavelengths of light most abundant in sunlight reaching Earth's surface.",
  "What is buoyancy?": "The upward force exerted by a fluid that opposes the weight of an immersed object.",
  "How does a speaker convert electricity into sound?": "An electromagnet attached to a cone vibrates in response to electrical signals, pushing the air.",
  "What is the escape velocity of Earth?": "The minimum speed an object needs to break free from Earth's gravitational pull ($11.2 \text{ km}/\text{s}$).",
  "Why do objects accelerate when they fall?": "Gravity applies a constant downward force, causing a constant change in speed (acceleration).",
  "What is momentum?": "A measure of the mass and velocity of an object ($p = mv$).",
  "How does a prism separate white light?": "It refracts different wavelengths (colors) of light by different amounts (dispersion).",
  "What is the difference between fission and fusion?": "Fission splits heavy atoms; fusion combines light atoms.",
  "Why is the surface tension of water so high?": "Strong cohesive forces (hydrogen bonds) between water molecules.",
  "What is the principle of conservation of momentum?": "In a closed system, the total momentum remains constant unless an external force acts on it.",
  "How does a magnifying glass work?": "It is a convex lens that refracts light to create a larger, virtual image.",
  "What is a standing wave?": "A wave that appears to stay in one place, formed by two waves of equal frequency and amplitude traveling in opposite directions.",
  "Why do we see objects when light is not shining directly at them?": "Light reflects off the objects and enters our eyes.",
  "What is thermodynamics?": "The study of heat and its relationship to other forms of energy.",
  "How is energy conserved in a simple pendulum?": "Potential energy converts to kinetic energy, and back again, over and over.",
  "What is refraction?": "The bending of light (or other waves) as it passes from one medium to another.",
  "Why does the resistance of a wire increase when it gets hot?": "Increased temperature causes atoms to vibrate more, hindering the flow of electrons.",
  "What is the Higgs boson?": "A fundamental particle associated with the Higgs field, which gives mass to other elementary particles.",
  "How do scientists measure the distance to stars?": "Using parallax (measuring the apparent shift in a star's position as Earth orbits the Sun).",
  "What is the unit of force?": "The Newton ($\text{N}$).",
  "Why does a car skid on ice?": "Ice drastically reduces the friction between the tires and the road.",
  "What is mechanical energy?": "The sum of potential energy and kinetic energy in a system.",
  "How does a laser produce light?": "It uses stimulated emission to produce coherent, monochromatic light.",
  "What is latent heat?": "The heat absorbed or released during a phase transition (like melting or boiling) without changing temperature.",
  "Why do radio waves travel farther than visible light waves?": "They have a lower frequency and longer wavelength, allowing them to diffract (bend) around obstacles more easily.",
  "What is the fundamental unit of matter?": "Quarks and leptons (or sometimes atoms, which are composed of them).",
  "How does a thermostat regulate temperature?": "It uses a bimetallic strip that bends with temperature change to switch a circuit on or off.",
  "What is pressure?": "Force exerted per unit area ($P = F/A$).",
  "Why is the center of the Sun so dense?": "The massive force of gravity from all the solar material compresses the core.",
  "What is the difference between alternating current (AC) and direct current (DC)?": "AC reverses direction periodically; DC flows only in one direction.",
  "How is a black hole detected?": "By observing its gravitational effects on nearby stars and gas, or by detecting Hawking radiation.",
  "What is the concept of a wave-particle duality?": "The idea that all matter exhibits both wave-like and particle-like properties.",
  "Why is copper used in electrical wiring?": "It has high electrical conductivity and is ductile (can be drawn into thin wires).",
  "What is the strong nuclear force?": "The force that binds quarks together into protons/neutrons and holds the atomic nucleus together.",
  "How does an optical lens form an image?": "It refracts light rays to either converge (convex) or diverge (concave) them.",
  "What is entropy?": "A measure of the disorder or randomness in a closed system (tends to increase over time).",
  "Why does the ocean appear blue?": "Water absorbs red light more effectively than blue light, and blue light is scattered back to our eyes.",
  "What is the unit of electrical potential difference?": "The Volt ($\text{V}$).",
  "How does a rocket launch into space?": "By expelling exhaust gases backward, creating forward thrust (Newton's Third Law: action/reaction).",
  "What is friction?": "A force that opposes motion between two surfaces that are in contact.",
  "Why does sound travel faster in water than in air?": "Water is denser and less compressible, allowing vibrations to transfer more efficiently.",
  "What is a light-year?": "The distance light travels in one Earth year (a unit of distance, not time).",
  "How does insulation keep a house warm?": "It contains trapped air pockets that prevent heat transfer by conduction, convection, and radiation.",
  "What is the weakest fundamental force?": "Gravity.",
  "Why does a baseball curve when thrown?": "The spin creates a pressure difference between the air passing over the two sides (Magnus effect).",
  "What is the photoelectric effect?": "The emission of electrons when electromagnetic radiation, such as light, hits a material.",
  "How does a solar cell work?": "Photons hit the silicon and knock electrons free, creating an electric current.",
  "What is viscosity?": "A measure of a fluid's resistance to flow (its 'thickness').",
  "Why does a spoon heat up quickly in hot soup?": "Heat is transferred rapidly through the metal spoon by conduction.",
  "What is a hologram?": "A three-dimensional image created by the interference patterns of two laser beams.",
  "How does an electromagnet work?": "Electric current passing through a coil of wire creates a temporary magnetic field.",
  "What is wave diffraction?": "The bending of waves as they pass through an opening or around an obstacle.",
  "Why does a balloon stick to the wall after being rubbed on hair?": "The static charge on the balloon induces an opposite charge on the wall, causing attraction.",
  "What is the principle of superposition of waves?": "When two or more waves meet, the resulting disturbance is the sum of the individual disturbances.",
  "How is gravity different from electromagnetism?": "Gravity is always attractive; electromagnetism can be attractive or repulsive and is much stronger.",
  "What is the critical temperature of a material?": "The temperature above which a gas cannot be liquefied, no matter how much pressure is applied.",
  "Why does a car engine need coolant?": "To absorb and dissipate the excess heat generated by burning fuel (thermal energy conversion).",
  "What is a positron?": "The antiparticle of the electron; it has the same mass but a positive charge.",
  "How does a radio transmitter send music?": "It modulates (changes) a carrier wave's amplitude (AM) or frequency (FM) to encode the sound information.",
  "What is the unit of electrical power?": "The Watt ($\text{W}$).",
  "Why is the core of the Earth still hot?": "Leftover heat from formation and radioactive decay of elements like uranium and thorium.",
  "What is plasma?": "The fourth state of matter, a highly energetic gas of ions and free electrons.",
  "How do physicists define a 'system'?": "A defined region of the universe under study, separated from its surroundings.",
  "What is the least action principle?": "The path taken by a physical system is the one for which the action is minimized (a fundamental principle in mechanics).",
  "Why do we see a flash of light before we hear thunder?": "The speed of light is nearly instantaneous over short distances, while sound is much slower.",
  "What is the concept of dark matter?": "A hypothetical form of matter that doesn't emit or absorb light but is inferred from its gravitational effects.",
  "How does a pendulum keep time?": "The period of its swing (the time it takes for one back-and-forth motion) depends only on its length, not its amplitude.",
  "What is the difference between heat and temperature?": "Heat is the total energy of molecular motion; temperature is the average kinetic energy of the molecules.",
  "Why do astronauts float in space?": "They are in a continuous state of freefall (orbiting) around Earth, experiencing weightlessness.",
  "What is the fundamental force responsible for radioactive decay?": "The weak nuclear force.",
  "How is pressure measured in the atmosphere?": "Using a barometer, which typically measures the weight of the air column above a point.",
  "What is the inverse-square law?": "Many physical quantities (like light intensity or gravity) decrease in proportion to the square of the distance from the source.",
  "Why do your hands get warm when you rub them together?": "Friction converts mechanical energy into thermal energy (heat).",
  "What is capacitance?": "The ability of a system to store an electric charge.",
  "How does a telescope collect light from distant galaxies?": "It uses large lenses or mirrors to gather vast amounts of light (photons) and focus them to a single point.",
  "What is a quark?": "A type of elementary particle and a fundamental constituent of matter (combines to form protons and neutrons).",
  "Why is the night sky dark (Olbers' Paradox)?": "The universe is expanding and is not infinitely old, limiting the total amount of light that reaches us.",
  "What is the unit of frequency?": "The Hertz ($\text{Hz}$), which is one cycle per second.",
  "How does a microwave oven stop when the door is opened?": "It has safety interlocks that immediately shut off the magnetron (microwave emitter).",
  "What is diffraction grating?": "An optical component with a periodic structure that splits and diffracts light into several beams"
}